myapp/app/Controllers/ContactsController.php

SELECT *
FROM `contacts`
ORDER BY `id` DESC
---
    public function index()
    {
		$data['records']	=  db('contacts')->orderBy('id', 'DESC')->get()->getResult();