myapp/app/Controllers/HomeController.php

SELECT *
FROM `home`
SELECT *
FROM `services`
SELECT *
FROM `about`
---
    public function index()
    {
		$data['records']  =  db('home')->get()->getResult();
		$data['services'] =  db('services')->get()->getResult();
		$data['abouts']   =  db('about')->get()->getResult();