myapp/app/Controllers/NeventsController.php

SELECT *
FROM `nevents`
ORDER BY `id` DESC
---
    public function index()
    {
		$data['records']	=  db('nevents')->orderBy('id', 'DESC')->get()->getResult();